base/Catalogs/бит_НаборыОграниченийИХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НаборыОграниченийИХарактеристик</Name>
			<Comment>ЛТ6.2</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитХарактеристики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаОграничений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловияПрименения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПроверки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РежимПроверкиСозданияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище_УсловияПрименения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище_УсловияОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компоновщик_УсловияПрименения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компоновщик_УсловияОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_НаборыОграниченийИХарактеристик/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Инициализация();
	
КонецПроцедуры


&НаСервере
Процедура Инициализация()
	
	//ВариантИсполненияГП - Условия применения
   
	СхемаКомпоновкиДанных_ВариантИсполненияГП = Новый СхемаКомпоновкиДанных;
	
	Справочники.бит_НаборыОграниченийИХарактеристик.Инициализировать_СхемуКомпоновкиДанныхОтбора(СхемаКомпоновкиДанных_ВариантИсполненияГП);
	ХранилищеСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных_ВариантИсполненияГП, Новый УникальныйИдентификатор);
	КомпоновщикНастроек_ВариантИсполненияГП.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ХранилищеСхемы));
	КомпоновщикНастроек_ВариантИсполненияГП.ЗагрузитьНастройки(СхемаКомпоновкиДанных_ВариантИсполненияГП.НастройкиПоУмолчанию);
	
	//ЗначениеПараметра - Условия отбора значения
	
	//_ТипЗначенияПараметра = глПолучитьТипЗначенияПараметра(Параметр);
	//глИнициализировать_ПостроительОтчета(ПостроительОтчета_ЗначениеПараметра, _ТипЗначенияПараметра, "Значение параметра");
	СхемаКомпоновкиДанных_ЗначениеПараметра = новый СхемаКомпоновкиДанных;
	
	Справочники.бит_НаборыОграниченийИХарактеристик.Инициализировать_СхемуКомпоновкиДанныхЗначений(СхемаКомпоновкиДанных_ЗначениеПараметра, Объект.РеквизитХарактеристики);
	ХранилищеСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных_ЗначениеПараметра, Новый УникальныйИдентификатор);
	КомпоновщикНастроек_ЗначениеПараметра.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ХранилищеСхемы));
	КомпоновщикНастроек_ЗначениеПараметра.ЗагрузитьНастройки(СхемаКомпоновкиДанных_ЗначениеПараметра.НастройкиПоУмолчанию);
	
КонецПроцедуры



&НаКлиенте
Процедура ПравилаОграниченийПриАктивизацииСтроки(Элемент)
	
	КомпоновщикНастроек_ВариантИсполненияГП.Настройки.Отбор.Элементы.Очистить();
	КомпоновщикНастроек_ЗначениеПараметра.Настройки.Отбор.Элементы.Очистить();
	
	

	//ДД = РеквизитФормыВЗначение("Объект");
	
	ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ИдентификаторСтроки = Элементы.ПравилаОграничений.ТекущиеДанные.НомерСтроки - 1;
		            
		//УсловияПрименения
	
		_Хранилище_УсловияПрименения_Отбор = ПолучитьЗначениеХранилищаЗначений(ИдентификаторСтроки, "Хранилище_УсловияПрименения");//ТекущиеДанные.Хранилище_УсловияПрименения.Получить();
		
		Если НЕ _Хранилище_УсловияПрименения_Отбор = Неопределено Тогда
			
			Для Каждого _Хранилище_ЭлементОтбора Из _Хранилище_УсловияПрименения_Отбор.Элементы Цикл
				
				_ЭлементОтбора = КомпоновщикНастроек_ВариантИсполненияГП.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

				ЗаполнитьЗначенияСвойств(_ЭлементОтбора, _Хранилище_ЭлементОтбора);
					
			КонецЦикла;
			
		КонецЕсли;                  
		
		//УсловияОтбора
		
		_Хранилище_УсловияОтбора_Отбор = ПолучитьЗначениеХранилищаЗначений(ИдентификаторСтроки, "Хранилище_УсловияОтбора");//ТекущиеДанные.Хранилище_УсловияОтбора.Получить();
		
		Если НЕ _Хранилище_УсловияОтбора_Отбор = Неопределено Тогда
			
			Для Каждого _Хранилище_ЭлементОтбора Из _Хранилище_УсловияОтбора_Отбор.Элементы Цикл
				
				_ЭлементОтбора = КомпоновщикНастроек_ЗначениеПараметра.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

				ЗаполнитьЗначенияСвойств(_ЭлементОтбора, _Хранилище_ЭлементОтбора);
					
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеХранилищаЗначений(Идентификатор, ИмяРеквизита)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Значение = СправочникОбъект.ПравилаОграничений[Идентификатор][ИмяРеквизита];
	
	Возврат Значение.Получить();
	
КонецФункции

&НаКлиенте
Процедура ПравилаОграниченийПередУдалением(Элемент, Отказ)
	
	ПравилаОграниченийПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилищеЗначений(НастройкиОтбор, Идентификатор, ИмяРеквизита) 
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Значение = Новый ХранилищеЗначения(НастройкиОтбор);

	//СправочникОбъект.ЗаполнитьХранилищеЗначений(Значение);
	//Объект.ПравилаОграничений[0].
	СправочникОбъект.ПравилаОграничений[Идентификатор][ИмяРеквизита] = Значение;

	//ПроверяемЧтоТакойОтборУжеЕсть
	Отказ =  Ложь;
	Если ИмяРеквизита = "Хранилище_УсловияПрименения" Тогда
		Для Каждого ЭлСтрока Из СправочникОбъект.ПравилаОграничений Цикл
			Если ЭлСтрока.НомерСтроки - 1 <> Идентификатор
				И Строка(ЭлСтрока[ИмяРеквизита].Получить()) = Строка(НастройкиОтбор) Тогда
				Сообщить("Строки с наименованиями " + ЭлСтрока.Наименование + ", " + СправочникОбъект.ПравилаОграничений[Идентификатор].Наименование + " имеют одинаковые отборы.");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СправочникОбъект.Записать();
	Прочитать();
	//
	//ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");

	//Модифицированность = Истина;	
	
	//Возврат Новый ХранилищеЗначения(Значение);
	
КонецПроцедуры


&НаКлиенте
Процедура КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПослеУдаления(Элемент)
	
	КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПриОкончанииРедактирования(Элемент, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	_ТЧПравилаОграничений_ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
		
	ИдентификаторСтроки = Элементы.ПравилаОграничений.ТекущиеДанные.НомерСтроки - 1;
	
	НастройкиОтбор = КомпоновщикНастроек_ВариантИсполненияГП.Настройки.Отбор;
	
	ПоместитьВХранилищеЗначений(НастройкиОтбор, ИдентификаторСтроки, "Хранилище_УсловияПрименения");
//	ПоместитьВХранилищеЗначений(КомпоновщикНастроек_ВариантИсполненияГП.Настройки, ИдентификаторСтроки, "Компоновщик_УсловияПрименения");
	
	_ТЧПравилаОграничений_ТекущиеДанные.УсловияПрименения = НастройкиОтбор;
	
КонецПроцедуры   

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПослеУдаления(Элемент)
	
	КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПриОкончанииРедактирования(Элемент, Ложь, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	_ТЧПравила_ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
		
	ИдентификаторСтроки = Элементы.ПравилаОграничений.ТекущиеДанные.НомерСтроки - 1;
	
	НастройкиОтбор = КомпоновщикНастроек_ЗначениеПараметра.Настройки.Отбор;
	
	ПоместитьВХранилищеЗначений(НастройкиОтбор, ИдентификаторСтроки, "Хранилище_УсловияОтбора");
	//ПоместитьВХранилищеЗначений(КомпоновщикНастроек_ЗначениеПараметра.Настройки, ИдентификаторСтроки, "Компоновщик_УсловияОтбора");
	
	_ТЧПравила_ТекущиеДанные.УсловиеОтбора = НастройкиОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РеквизитХарактеристикиПриИзменении(Элемент)
	Инициализация();
КонецПроцедуры
